#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Макет, ИмяМакета;
	ИмяМакета = "СправкаПравила";
	Если Параметры.Страница = "СтраницаПользователи" Тогда
		ИмяМакета = "СправкаИсключения";
	ИначеЕсли Параметры.Страница = "СтраницаРоли" Тогда
		ИмяМакета = "СправкаРоли";
	ИначеЕсли Параметры.Страница = "СтраницаОхват" Тогда
		ИмяМакета = "СправкаИстория";
	КонецЕсли;
	Макет = Обработки.Cutter3000_ОбрезкаБазы.ПолучитьМакет(ИмяМакета);
	ТекстСправки = Макет.ПолучитьТекст();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
