#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Команды.Обновить.Картинка = БиблиотекаКартинок.Cutter3000_Обновить;
	Команды.ОткрытьДетализацию.Картинка = БиблиотекаКартинок.Cutter3000_ДеталиОшибки;
	Параметры.Свойство("Запуск", Запуск);
	Параметры.Свойство("Задание", Задание);
	ОбновитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицы

&НаКлиенте
Процедура ОшибкиТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СтрокаОшибки = Ошибки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаОшибки <> Неопределено Тогда
		ОткрытьВыбраннуюОшибку(СтрокаОшибки.Идентификатор);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)

	ОбновитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДетализацию(Команда)

	СтрокаОшибки = Элементы.ОшибкиТаблица.ТекущиеДанные;
	Если СтрокаОшибки <> Неопределено Тогда
		ОткрытьВыбраннуюОшибку(СтрокаОшибки.Идентификатор);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьНаСервере()

	СписокОшибок = Cutter3000_ЗаданияСервер.СписокОшибокЗадания(Запуск, Задание);
	ЗначениеВРеквизитФормы(СписокОшибок, "Ошибки");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыбраннуюОшибку(Идентификатор)

	ПараметрыДетализации = Новый Структура("Запуск,Идентификатор", Запуск, Идентификатор);
	ОткрытьФорму("Обработка.Cutter3000_ОбрезкаБазы.Форма.ДетализацияОшибки",
		ПараметрыДетализации, ЭтаФорма, Запуск + "|" + Идентификатор);

КонецПроцедуры

#КонецОбласти




